package com.example.islamicapps.sura;

import java.util.ArrayList;
import java.util.List;

public class SuraCollection {
    public static List<Sura> getAllSura(){
        List<Sura> allSura = new ArrayList<>();

        Sura singleSura = null;

       // singleSura = new Sura("Fatiha", "..................");
       // allSura.add(singleSura);

      //  singleSura = new Sura();
       // singleSura.setSuraName("০২ সূরা আল বাক্বারা");
       // singleSura.setSuraDetails("");
       // allSura.add(singleSura);

        singleSura = new Sura();
        singleSura.setSuraName(" সূরা আল ফাতিহা");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ\n" +
                "01\n" +
                "\n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ\n" +
                "02\n" +
                "\n" +
                "যাবতীয় প্রশংসা আল্লাহ তা’ আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।  \n" +
                " \n" +
                "الرَّحْمـنِ الرَّحِيمِ\n" +
                "03\n" +
                "\n" +
                "যিনি নিতান্ত মেহেরবান ও দয়ালু।  \n" +
                " \n" +
                "مَـالِكِ يَوْمِ الدِّينِ\n" +
                "04\n" +
                "\n" +
                "যিনি বিচার দিনের মালিক।  \n" +
                " \n" +
                "إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ\n" +
                "05\n" +
                "\n" +
                "আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।  \n" +
                " \n" +
                "اهدِنَــــا الصِّرَاطَ المُستَقِيمَ\n" +
                "06\n" +
                "\n" +
                "আমাদেরকে সরল পথ দেখাও,  \n" +
                " \n" +
                "صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ\n" +
                "07\n" +
                "\n" +
                "সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
        singleSura.setSuraName(" সূরা আন নাস");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "قُلْ أَعُوذُ بِرَبِّ النَّاسِ\n" +
                "01\n" +
                "\n" +
                "বলুন, আমি আশ্রয় গ্রহণ করিতেছি মানুষের পালনকর্তার,  \n" +
                " \n" +
                "مَلِكِ النَّاسِ\n" +
                "02\n" +
                "\n" +
                "মানুষের অধিপতির,  \n" +
                " \n" +
                "إِلَهِ النَّاسِ\n" +
                "03\n" +
                "\n" +
                "মানুষের মা’বুদের  \n" +
                " \n" +
                "مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ\n" +
                "04\n" +
                "\n" +
                "তার অনিষ্ট থেকে, যে কুমন্ত্রণা দেয় ও আত্নগোপন করে,  \n" +
                " \n" +
                "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ\n" +
                "05\n" +
                "\n" +
                "যে কুমন্ত্রণা দেয় মানুষের অন্তরে  \n" +
                " \n" +
                "مِنَ الْجِنَّةِ وَ النَّاسِ\n" +
                "06\n" +
                "\n" +
                "জ্বিনের মধ্য থেকে অথবা মানুষের মধ্য থেকে।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
         singleSura.setSuraName("সূরা আল ফালাক");
         singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                 "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                 " \n" +
                 "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ\n" +
                 "01\n" +
                 "\n" +
                 "বলুন, আমি আশ্রয় গ্রহণ করছি প্রভাতের পালনকর্তার,  \n" +
                 " \n" +
                 "مِن شَرِّ مَا خَلَقَ\n" +
                 "02\n" +
                 "\n" +
                 "তিনি যা সৃষ্টি করেছেন, তার অনিষ্ট থেকে,  \n" +
                 " \n" +
                 "وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ\n" +
                 "03\n" +
                 "\n" +
                 "অন্ধকার রাত্রির অনিষ্ট থেকে, যখন তা সমাগত হয়,  \n" +
                 " \n" +
                 "وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ\n" +
                 "04\n" +
                 "\n" +
                 "গ্রন্থিতে ফুঁৎকার দিয়ে জাদুকারিনীদের অনিষ্ট থেকে  \n" +
                 " \n" +
                 "وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\n" +
                 "05\n" +
                 "\n" +
                 "এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।  ");
         allSura.add(singleSura);





        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল ইখলাস");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "قُلْ هُوَ اللَّهُ أَحَدٌ\n" +
                "01\n" +
                "\n" +
                "বলুন, তিনি আল্লাহ, এক,  \n" +
                " \n" +
                "اللَّهُ الصَّمَدُ\n" +
                "02\n" +
                "\n" +
                "আল্লাহ অমুখাপেক্ষী,  \n" +
                " \n" +
                "لَمْ يَلِدْ وَلَمْ يُولَدْ\n" +
                "03\n" +
                "\n" +
                "তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি  \n" +
                " \n" +
                "وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ\n" +
                "04\n" +
                "\n" +
                "এবং তার সমতুল্য কেউ নেই।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
        singleSura.setSuraName("সূরা লাহাব");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ\n" +
                "01\n" +
                "\n" +
                "আবু লাহাবের হস্তদ্বয় ধ্বংস হোক এবং ধ্বংস হোক সে নিজে,  \n" +
                " \n" +
                "مَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ\n" +
                "02\n" +
                "\n" +
                "কোন কাজে আসেনি তার ধন-সম্পদ ও যা সে উপার্জন করেছে।  \n" +
                " \n" +
                "سَيَصْلَى نَارًا ذَاتَ لَهَبٍ\n" +
                "03\n" +
                "\n" +
                "সত্বরই সে প্রবেশ করবে লেলিহান অগ্নিতে  \n" +
                " \n" +
                "وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ\n" +
                "04\n" +
                "\n" +
                "এবং তার স্ত্রীও-যে ইন্ধন বহন করে,  \n" +
                " \n" +
                "فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ\n" +
                "05\n" +
                "\n" +
                "তার গলদেশে খর্জুরের রশি নিয়ে।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
        singleSura.setSuraName("সূরা নাসর");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "إِذَا جَاء نَصْرُ اللَّهِ وَالْفَتْحُ\n" +
                "01\n" +
                "\n" +
                "যখন আসবে আল্লাহর সাহায্য ও বিজয়  \n" +
                " \n" +
                "وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا\n" +
                "02\n" +
                "\n" +
                "এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন,  \n" +
                " \n" +
                "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا\n" +
                "03\n" +
                "\n" +
                "তখন আপনি আপনার পালনকর্তার পবিত্রতা বর্ণনা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন। নিশ্চয় তিনি ক্ষমাকারী।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা কাফিরুন");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "قُلْ يَا أَيُّهَا الْكَافِرُونَ\n" +
                "01\n" +
                "\n" +
                "বলুন, হে কাফেরকূল,  \n" +
                " \n" +
                "لَا أَعْبُدُ مَا تَعْبُدُونَ\n" +
                "02\n" +
                "\n" +
                "আমি এবাদত করিনা, তোমরা যার এবাদত কর।  \n" +
                " \n" +
                "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\n" +
                "03\n" +
                "\n" +
                "এবং তোমরাও এবাদতকারী নও, যার এবাদত আমি করি  \n" +
                " \n" +
                "وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ\n" +
                "04\n" +
                "\n" +
                "এবং আমি এবাদতকারী নই, যার এবাদত তোমরা কর।  \n" +
                " \n" +
                "وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\n" +
                "05\n" +
                "\n" +
                "তোমরা এবাদতকারী নও, যার এবাদত আমি করি।  \n" +
                " \n" +
                "لَكُمْ دِينُكُمْ وَلِيَ دِينِ\n" +
                "06\n" +
                "\n" +
                "তোমাদের কর্ম ও কর্মফল তোমাদের জন্যে এবং আমার কর্ম ও কর্মফল আমার জন্যে। ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName(" সূরা আল কাওসার");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ\n" +
                "01\n" +
                "\n" +
                "নিশ্চয় আমি আপনাকে কাওসার দান করেছি।  \n" +
                " \n" +
                "فَصَلِّ لِرَبِّكَ وَانْحَرْ\n" +
                "02\n" +
                "\n" +
                "অতএব আপনার পালনকর্তার উদ্দেশ্যে নামায পড়ুন এবং কোরবানী করুন।  \n" +
                " \n" +
                "إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ\n" +
                "03\n" +
                "\n" +
                "যে আপনার শত্রু, সেই তো লেজকাটা, নির্বংশ।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল মাউন");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ\n" +
                "01\n" +
                "\n" +
                "আপনি কি দেখেছেন তাকে, যে বিচারদিবসকে মিথ্যা বলে?  \n" +
                " \n" +
                "فَذَلِكَ الَّذِي يَدُعُّ الْيَتِيمَ\n" +
                "02\n" +
                "\n" +
                "সে সেই ব্যক্তি, যে এতীমকে গলা ধাক্কা দেয়  \n" +
                " \n" +
                "وَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ\n" +
                "03\n" +
                "\n" +
                "এবং মিসকীনকে অন্ন দিতে উৎসাহিত করে না।  \n" +
                " \n" +
                "فَوَيْلٌ لِّلْمُصَلِّينَ\n" +
                "04\n" +
                "\n" +
                "অতএব দুর্ভোগ সেসব নামাযীর,  \n" +
                " \n" +
                "الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ\n" +
                "05\n" +
                "\n" +
                "যারা তাদের নামায সম্বন্ধে বে-খবর;  \n" +
                " \n" +
                "الَّذِينَ هُمْ يُرَاؤُونَ\n" +
                "06\n" +
                "\n" +
                "যারা তা লোক-দেখানোর জন্য করে  \n" +
                " \n" +
                "وَيَمْنَعُونَ الْمَاعُونَ\n" +
                "07\n" +
                "\n" +
                "এবং নিত্য ব্যবহার্য্য বস্তু অন্যকে দেয় না।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল কুরাইশ");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "لِإِيلَافِ قُرَيْشٍ\n" +
                "01\n" +
                "\n" +
                "কোরাইশের আসক্তির কারণে,  \n" +
                " \n" +
                "إِيلَافِهِمْ رِحْلَةَ الشِّتَاء وَالصَّيْفِ\n" +
                "02\n" +
                "\n" +
                "আসক্তির কারণে তাদের শীত ও গ্রীষ্মকালীন সফরের।  \n" +
                " \n" +
                "فَلْيَعْبُدُوا رَبَّ هَذَا الْبَيْتِ\n" +
                "03\n" +
                "\n" +
                "অতএব তারা যেন এবাদত করে এই ঘরের পালনকর্তার  \n" +
                " \n" +
                "الَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ\n" +
                "04\n" +
                "\n" +
                "যিনি তাদেরকে ক্ষুধায় আহার দিয়েছেন এবং যুদ্ধভীতি থেকে তাদেরকে নিরাপদ করেছেন।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল ফীল");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ\n" +
                "01\n" +
                "\n" +
                "আপনি কি দেখেননি আপনার পালনকর্তা হস্তীবাহিনীর সাথে কিরূপ ব্যবহার করেছেন?  \n" +
                " \n" +
                "أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ\n" +
                "02\n" +
                "\n" +
                "তিনি কি তাদের চক্রান্ত নস্যাৎ করে দেননি?  \n" +
                " \n" +
                "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ\n" +
                "03\n" +
                "\n" +
                "তিনি তাদের উপর প্রেরণ করেছেন ঝাঁকে ঝাঁকে পাখী,  \n" +
                " \n" +
                "تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ\n" +
                "04\n" +
                "\n" +
                "যারা তাদের উপর পাথরের কংকর নিক্ষেপ করছিল।  \n" +
                " \n" +
                "فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ\n" +
                "05\n" +
                "\n" +
                "অতঃপর তিনি তাদেরকে ভক্ষিত তৃণসদৃশ করে দেন।  ");
        allSura.add(singleSura);



        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল হুমাযাহ");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ\n" +
                "01\n" +
                "\n" +
                "প্রত্যেক পশ্চাতে ও সম্মুখে পরনিন্দাকারীর দুর্ভোগ,  \n" +
                " \n" +
                "الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ\n" +
                "02\n" +
                "\n" +
                "যে অর্থ সঞ্চিত করে ও গণনা করে  \n" +
                " \n" +
                "يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ\n" +
                "03\n" +
                "\n" +
                "সে মনে করে যে, তার অর্থ চিরকাল তার সাথে থাকবে!  \n" +
                " \n" +
                "كَلَّا لَيُنبَذَنَّ فِي الْحُطَمَةِ\n" +
                "04\n" +
                "\n" +
                "কখনও না, সে অবশ্যই নিক্ষিপ্ত হবে পিষ্টকারীর মধ্যে।  \n" +
                " \n" +
                "وَمَا أَدْرَاكَ مَا الْحُطَمَةُ\n" +
                "05\n" +
                "\n" +
                "আপনি কি জানেন, পিষ্টকারী কি?  \n" +
                " \n" +
                "نَارُ اللَّهِ الْمُوقَدَةُ\n" +
                "06\n" +
                "\n" +
                "এটা আল্লাহর প্রজ্জ্বলিত অগ্নি,  \n" +
                " \n" +
                "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ\n" +
                "07\n" +
                "\n" +
                "যা হৃদয় পর্যন্ত পৌছবে।  \n" +
                " \n" +
                "إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ\n" +
                "08\n" +
                "\n" +
                "এতে তাদেরকে বেঁধে দেয়া হবে,  \n" +
                " \n" +
                "فِي عَمَدٍ مُّمَدَّدَةٍ\n" +
                "09\n" +
                "\n" +
                "লম্বা লম্বা খুঁটিতে।  ");
        allSura.add(singleSura);

        singleSura = new Sura();
        singleSura.setSuraName(" সূরা আল আছর");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "وَالْعَصْرِ\n" +
                "01\n" +
                "\n" +
                "কসম যুগের (সময়ের),  \n" +
                " \n" +
                "إِنَّ الْإِنسَانَ لَفِي خُسْرٍ\n" +
                "02\n" +
                "\n" +
                "নিশ্চয় মানুষ ক্ষতিগ্রস্ত;  \n" +
                " \n" +
                "إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ\n" +
                "03\n" +
                "\n" +
                "কিন্তু তারা নয়, যারা বিশ্বাস স্থাপন করে ও সৎকর্ম করে এবং পরস্পরকে তাকীদ করে সত্যের এবং তাকীদ করে সবরের।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName(" সূরা আত তাকাছুর");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "أَلْهَاكُمُ التَّكَاثُرُ\n" +
                "01\n" +
                "\n" +
                "প্রাচুর্যের লালসা তোমাদেরকে গাফেল রাখে,  \n" +
                " \n" +
                "حَتَّى زُرْتُمُ الْمَقَابِرَ\n" +
                "02\n" +
                "\n" +
                "এমনকি, তোমরা কবরস্থানে পৌছে যাও।  \n" +
                " \n" +
                "كَلَّا سَوْفَ تَعْلَمُونَ\n" +
                "03\n" +
                "\n" +
                "এটা কখনও উচিত নয়। তোমরা সত্ত্বরই জেনে নেবে।  \n" +
                " \n" +
                "ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ\n" +
                "04\n" +
                "\n" +
                "অতঃপর এটা কখনও উচিত নয়। তোমরা সত্ত্বরই জেনে নেবে।  \n" +
                " \n" +
                "كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ\n" +
                "05\n" +
                "\n" +
                "কখনই নয়; যদি তোমরা নিশ্চিত জানতে।  \n" +
                " \n" +
                "لَتَرَوُنَّ الْجَحِيمَ\n" +
                "06\n" +
                "\n" +
                "তোমরা অবশ্যই জাহান্নাম দেখবে,  \n" +
                " \n" +
                "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ\n" +
                "07\n" +
                "\n" +
                "অতঃপর তোমরা তা অবশ্যই দেখবে দিব্য প্রত্যয়ে,  \n" +
                " \n" +
                "ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ\n" +
                "08\n" +
                "\n" +
                "এরপর অবশ্যই সেদিন তোমরা নেয়ামত সম্পর্কে জিজ্ঞাসিত হবে।  ");
        allSura.add(singleSura);

        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল ক্বারিয়াহ");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "الْقَارِعَةُ\n" +
                "01\n" +
                "\n" +
                "করাঘাতকারী  \n" +
                " \n" +
                "مَا الْقَارِعَةُ\n" +
                "02\n" +
                "\n" +
                "করাঘাতকারী কি?  \n" +
                " \n" +
                "وَمَا أَدْرَاكَ مَا الْقَارِعَةُ\n" +
                "03\n" +
                "\n" +
                "করাঘাতকারী সম্পর্কে আপনি কি জানেন ?  \n" +
                " \n" +
                "يَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِ\n" +
                "04\n" +
                "\n" +
                "যেদিন মানুষ হবে বিক্ষিপ্ত পতংগের মত  \n" +
                " \n" +
                "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنفُوشِ\n" +
                "05\n" +
                "\n" +
                "এবং পর্বতমালা হবে ধুনিত রঙ্গীন পশমের মত।  \n" +
                " \n" +
                "فَأَمَّا مَن ثَقُلَتْ مَوَازِينُهُ\n" +
                "06\n" +
                "\n" +
                "অতএব যার পাল্লা ভারী হবে,  \n" +
                " \n" +
                "فَهُوَ فِي عِيشَةٍ رَّاضِيَةٍ\n" +
                "07\n" +
                "\n" +
                "সে সুখীজীবন যাপন করবে।  \n" +
                " \n" +
                "وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ\n" +
                "08\n" +
                "\n" +
                "আর যার পাল্লা হালকা হবে,  \n" +
                " \n" +
                "فَأُمُّهُ هَاوِيَةٌ\n" +
                "09\n" +
                "\n" +
                "তার ঠিকানা হবে হাবিয়া।  \n" +
                " \n" +
                "وَمَا أَدْرَاكَ مَا هِيَهْ\n" +
                "10\n" +
                "\n" +
                "আপনি জানেন তা কি?  \n" +
                " \n" +
                "نَارٌ حَامِيَةٌ\n" +
                "11\n" +
                "\n" +
                "প্রজ্জ্বলিত অগ্নি!  ");
        allSura.add(singleSura);

        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল আদিয়াত");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "وَالْعَادِيَاتِ ضَبْحًا\n" +
                "01\n" +
                "\n" +
                "শপথ উর্ধ্বশ্বাসে চলমান অশ্বসমূহের,  \n" +
                " \n" +
                "فَالْمُورِيَاتِ قَدْحًا\n" +
                "02\n" +
                "\n" +
                "অতঃপর ক্ষুরাঘাতে অগ্নিবিচ্ছুরক অশ্বসমূহের  \n" +
                " \n" +
                "فَالْمُغِيرَاتِ صُبْحًا\n" +
                "03\n" +
                "\n" +
                "অতঃপর প্রভাতকালে আক্রমণকারী অশ্বসমূহের  \n" +
                " \n" +
                "فَأَثَرْنَ بِهِ نَقْعًا\n" +
                "04\n" +
                "\n" +
                "ও যারা সে সময়ে ধুলি উৎক্ষিপ্ত করে  \n" +
                " \n" +
                "فَوَسَطْنَ بِهِ جَمْعًا\n" +
                "05\n" +
                "\n" +
                "অতঃপর যারা শক্রদলের অভ্যন্তরে ঢুকে পড়ে-  \n" +
                " \n" +
                "إِنَّ الْإِنسَانَ لِرَبِّهِ لَكَنُودٌ\n" +
                "06\n" +
                "\n" +
                "নিশ্চয় মানুষ তার পালনকর্তার প্রতি অকৃতজ্ঞ।  \n" +
                " \n" +
                "وَإِنَّهُ عَلَى ذَلِكَ لَشَهِيدٌ\n" +
                "07\n" +
                "\n" +
                "এবং সে অবশ্য এ বিষয়ে অবহিত  \n" +
                " \n" +
                "وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ\n" +
                "08\n" +
                "\n" +
                "এবং সে নিশ্চিতই ধন-সম্পদের ভালবাসায় মত্ত।  \n" +
                " \n" +
                "أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ\n" +
                "09\n" +
                "\n" +
                "সে কি জানে না, যখন কবরে যা আছে, তা উত্থিত হবে  \n" +
                " \n" +
                "وَحُصِّلَ مَا فِي الصُّدُورِ\n" +
                "10\n" +
                "\n" +
                "এবং অন্তরে যা আছে, তা অর্জন করা হবে?  \n" +
                " \n" +
                "إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌ\n" +
                "11\n" +
                "\n" +
                "সেদিন তাদের কি হবে, সে সম্পর্কে তাদের পালনকর্তা সবিশেষ জ্ঞাত।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল যিলযাল");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا\n" +
                "01\n" +
                "\n" +
                "যখন পৃথিবী তার কম্পনে প্রকম্পিত হবে,  \n" +
                " \n" +
                "وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا\n" +
                "02\n" +
                "\n" +
                "যখন সে তার বোঝা বের করে দেবে।  \n" +
                " \n" +
                "وَقَالَ الْإِنسَانُ مَا لَهَا\n" +
                "03\n" +
                "\n" +
                "এবং মানুষ বলবে, এর কি হল ?  \n" +
                " \n" +
                "يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا\n" +
                "04\n" +
                "\n" +
                "সেদিন সে তার বৃত্তান্ত বর্ণনা করবে,  \n" +
                " \n" +
                "بِأَنَّ رَبَّكَ أَوْحَى لَهَا\n" +
                "05\n" +
                "\n" +
                "কারণ, আপনার পালনকর্তা তাকে আদেশ করবেন।  \n" +
                " \n" +
                "يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِّيُرَوْا أَعْمَالَهُمْ\n" +
                "06\n" +
                "\n" +
                "সেদিন মানুষ বিভিন্ন দলে প্রকাশ পাবে, যাতে তাদেরকে তাদের কৃতকর্ম দেখানো হয়।  \n" +
                " \n" +
                "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ\n" +
                "07\n" +
                "\n" +
                "অতঃপর কেউ অণু পরিমাণ সৎকর্ম করলে তা দেখতে পাবে  \n" +
                " \n" +
                "وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ\n" +
                "08\n" +
                "\n" +
                "এবং কেউ অণু পরিমাণ অসৎকর্ম করলে তাও দেখতে পাবে।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল বাইয়ানাহ");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّى تَأْتِيَهُمُ الْبَيِّنَةُ\n" +
                "01\n" +
                "\n" +
                "আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের ছিল, তারা প্রত্যাবর্তন করত না যতক্ষণ না তাদের কাছে সুস্পষ্ট প্রমাণ আসত।  \n" +
                " \n" +
                "رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً\n" +
                "02\n" +
                "\n" +
                "অর্থাৎ আল্লাহর একজন রসূল, যিনি আবৃত্তি করতেন পবিত্র সহীফা,  \n" +
                " \n" +
                "فِيهَا كُتُبٌ قَيِّمَةٌ\n" +
                "03\n" +
                "\n" +
                "যাতে আছে, সঠিক বিষয়বস্তু।  \n" +
                " \n" +
                "وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءتْهُمُ الْبَيِّنَةُ\n" +
                "04\n" +
                "\n" +
                "অপর কিতাব প্রাপ্তরা যে বিভ্রান্ত হয়েছে, তা হয়েছে তাদের কাছে সুস্পষ্ট প্রমাণ আসার পরেই।  \n" +
                " \n" +
                "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاء وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ\n" +
                "05\n" +
                "\n" +
                "তাদেরকে এছাড়া কোন নির্দেশ করা হয়নি যে, তারা খাঁটি মনে একনিষ্ঠভাবে আল্লাহর এবাদত করবে, নামায কায়েম করবে এবং যাকাত দেবে। এটাই সঠিক ধর্ম।  \n" +
                " \n" +
                "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا أُوْلَئِكَ هُمْ شَرُّ الْبَرِيَّةِ\n" +
                "06\n" +
                "\n" +
                "আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের, তারা জাহান্নামের আগুনে স্থায়ীভাবে থাকবে। তারাই সৃষ্টির অধম।  \n" +
                " \n" +
                "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُوْلَئِكَ هُمْ خَيْرُ الْبَرِيَّةِ\n" +
                "07\n" +
                "\n" +
                "যারা ঈমান আনে ও সৎকর্ম করে, তারাই সৃষ্টির সেরা।  \n" +
                " \n" +
                "جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ\n" +
                "08\n" +
                "\n" +
                "তাদের পালনকর্তার কাছে রয়েছে তাদের প্রতিদান চিরকাল বসবাসের জান্নাত, যার তলদেশে নির্ঝরিণী প্রবাহিত। তারা সেখানে থাকবে অনন্তকাল। আল্লাহ তাদের প্রতি সন্তুষ্ট এবং তারা আল্লাহর প্রতি সন্তুষ্ট। এটা তার জন্যে, যে তার পালনকর্তাকে ভয় কর।  ");
        allSura.add(singleSura);


        singleSura = new Sura();
        singleSura.setSuraName("সূরা আল ক্বদর");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ\n" +
                "01\n" +
                "\n" +
                "আমি একে নাযিল করেছি শবে-কদরে।  \n" +
                " \n" +
                "وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ\n" +
                "02\n" +
                "\n" +
                "শবে-কদর সমন্ধে আপনি কি জানেন?  \n" +
                " \n" +
                "لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ\n" +
                "03\n" +
                "\n" +
                "শবে-কদর হল এক হাজার মাস অপেক্ষা শ্রেষ্ঠ।  \n" +
                " \n" +
                "تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ\n" +
                "04\n" +
                "\n" +
                "এতে প্রত্যেক কাজের জন্যে ফেরেশতাগণ ও রূহ অবতীর্ণ হয় তাদের পালনকর্তার নির্দেশক্রমে।  \n" +
                " \n" +
                "سَلَامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ\n" +
                "05\n" +
                "\n" +
                "এটা নিরাপত্তা, যা ফজরের উদয় পর্যন্ত অব্যাহত থাকে।  ");
        allSura.add(singleSura);

        singleSura = new Sura();
        singleSura.setSuraName("সূরা আদ-দ্বোহা");
        singleSura.setSuraDetails("بِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ  \n" +
                "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।  \n" +
                " \n" +
                "وَالضُّحَى\n" +
                "01\n" +
                "\n" +
                "শপথ পূর্বাহ্নের,  \n" +
                " \n" +
                "وَاللَّيْلِ إِذَا سَجَى\n" +
                "02\n" +
                "\n" +
                "শপথ রাত্রির যখন তা গভীর হয়,  \n" +
                " \n" +
                "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَى\n" +
                "03\n" +
                "\n" +
                "আপনার পালনকর্তা আপনাকে ত্যাগ করেনি এবং আপনার প্রতি বিরূপও হননি।  \n" +
                " \n" +
                "وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَى\n" +
                "04\n" +
                "\n" +
                "আপনার জন্যে পরকাল ইহকাল অপেক্ষা শ্রেয়।  \n" +
                " \n" +
                "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى\n" +
                "05\n" +
                "\n" +
                "আপনার পালনকর্তা সত্বরই আপনাকে দান করবেন, অতঃপর আপনি সন্তুষ্ট হবেন।  \n" +
                " \n" +
                "أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى\n" +
                "06\n" +
                "\n" +
                "তিনি কি আপনাকে এতীমরূপে পাননি? অতঃপর তিনি আশ্রয় দিয়েছেন।  \n" +
                " \n" +
                "وَوَجَدَكَ ضَالًّا فَهَدَى\n" +
                "07\n" +
                "\n" +
                "তিনি আপনাকে পেয়েছেন পথহারা, অতঃপর পথপ্রদর্শন করেছেন।  \n" +
                " \n" +
                "وَوَجَدَكَ عَائِلًا فَأَغْنَى\n" +
                "08\n" +
                "\n" +
                "তিনি আপনাকে পেয়েছেন নিঃস্ব, অতঃপর অভাবমুক্ত করেছেন।  \n" +
                " \n" +
                "فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ\n" +
                "09\n" +
                "\n" +
                "সুতরাং আপনি এতীমের প্রতি কঠোর হবেন না;  \n" +
                " \n" +
                "وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ\n" +
                "10\n" +
                "\n" +
                "সওয়ালকারীকে ধমক দেবেন না।  \n" +
                " \n" +
                "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ\n" +
                "11\n" +
                "\n" +
                "এবং আপনার পালনকর্তার নেয়ামতের কথা প্রকাশ করুন।  ");
        allSura.add(singleSura);








        return allSura;


    }
}
